{
  "format": "graph-model",
  "generatedBy": "TensorFlow.js v4.15.0",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [null, 224, 224, 3],
            "dtype": "float32",
            "sparse": false,
            "name": "input_1"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_1",
            "trainable": true,
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "activation": "relu",
            "use_bias": true
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_1",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [2, 2],
            "padding": "valid",
            "strides": [2, 2],
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten_1",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 128,
            "activation": "relu",
            "use_bias": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "dtype": "float32",
            "units": 8,
            "activation": "softmax",
            "use_bias": true
          }
        }
      ]
    },
    "keras_version": "2.15.0",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": ["./weights.bin"],
      "weights": [
        {
          "name": "conv2d_1/kernel",
          "shape": [3, 3, 3, 32],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/bias",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [15488, 128],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [128, 8],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [8],
          "dtype": "float32"
        }
      ]
    }
  ],
  "modelConfig": {
    "inputShape": [224, 224, 3],
    "outputShape": [8],
    "labels": [
      "gunshot_wound",
      "shrapnel_wound", 
      "burn",
      "fracture_visible",
      "laceration",
      "blast_injury",
      "abrasion",
      "normal"
    ],
    "confidenceThreshold": 0.7,
    "description": "Battlefield Injury Detection Model - Demo Version"
  }
}